<a href="https://colab.research.google.com/github/Karalius/Calculator/blob/master/Untitled5.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [80]:
import psycopg2

# Connect to heroku, P.S. Hide this in local!
sql_connection = psycopg2.connect(
    database="dfvnovppbbq4rl",
    user="yntjjrygcmheyc",
    password="477cb32bc389caa14bd09da3c5c4a5ee704213bce0033af8db470ea5fbd2f5de",
    host="ec2-34-254-69-72.eu-west-1.compute.amazonaws.com",
    port="5432"
)

In [81]:
cur = sql_connection.cursor()

cur.execute('''
CREATE TABLE IF NOT EXISTS categories (
    id serial PRIMARY KEY,
    category varchar(250)
);

CREATE TABLE IF NOT EXISTS items (
    id serial PRIMARY KEY,
    category_id int,
    title varchar(250),
    price int,
    item_url varchar(500),
    img_url varchar(500),
    FOREIGN KEY (category_id) REFERENCES categories(id)
);

''')

sql_connection.commit()

In [3]:
# Create dataframe

In [5]:
dict_data = {'category' : ['namai', 'namai', 'namai', 'butai', 'butai', 'sklypai'],
             'title': ['nam','nam','nam','but','but', 'sklyp'],
             'price': [100, 120, 140, 200, 220, 300],
             }

In [6]:
df = pd.DataFrame(dict_data)

In [9]:
df

  category  title  price
0    namai    nam    100
1    namai    nam    120
2    namai    nam    140
3    butai    but    200
4    butai    but    220
5  sklypai  sklyp    300

In [92]:
unique_categories = tuple(df['category'].unique())

In [93]:
var_string = ', '.join(['%s'] * len(unique_categories))

In [67]:
query_string = 'INSERT INTO categories(category) VALUES (%s);' % var_string

In [68]:
query_string

'INSERT INTO categories(category) VALUES (%s, %s, %s);'